import { FC } from 'react';
// Next
import { useTranslation } from 'next-i18next';
// MUI
import Box from '@mui/material/Box';
import Divider from '@mui/material/Divider';
import Container from '@mui/material/Container';
// Components
import PageHeader from '@/components/PageHeader/pageHeader';
// Utils
import { LayoutSettings } from '@/configs/layout';
// styles
import classes from './aboutUs.module.scss';

const AboutUs: FC = () => {
  const { t } = useTranslation('about-us');

  const list = [
    'مادة الهيكل/الإطار: ساعة ذات سوار ستانلس ستيل بمشبك ثلاثي الطي بلمسة واحدة مع زجاج معدني وغطاء خلفي يقفل ببراغي، كما أنها مقاومة للماء حتى عمق 100 مترًا، بميزة ساعة توقيت لمدة 1/10 ثانية قياس السعة: 59 و59 دقيقة و9 جزء من الثانية - اوضاع القياس: الوقت المنقضي، الوقت المنقسم، أوقات المكانين الأول والثاني عرض التاريخ عرض التوقيت العادي التناظري: 3 عقارب للساعة والدقيقة والثانية، و3 أقراص (ساعة ايقاف 1/10 ثانية وساعة توقيت للدقائق وساعة توقيت للثواني) الدقة: ±20 ثانية في الشهر تقريباً. عمر البطارية: 3 سنوات مع SR920SW، حجم الهيكل: 52 × 48.9 × 12.4 ملم. الوزن الإجمالي: 172 جرام',
    'مادة الهيكل/الإطار: ساعة ذات سوار ستانلس ستيل بمشبك ثلاثي الطي بلمسة واحدة مع زجاج معدني وغطاء خلفي يقفل ببراغي، كما أنها مقاومة للماء حتى عمق 100 مترًا، بميزة ساعة توقيت لمدة 1/10 ثانية قياس السعة: 59 و59 دقيقة و9 جزء من الثانية - اوضاع القياس: الوقت المنقضي، الوقت المنقسم، أوقات المكانين الأول والثاني عرض التاريخ عرض التوقيت العادي التناظري: 3 عقارب للساعة والدقيقة والثانية، و3 أقراص (ساعة ايقاف 1/10 ثانية وساعة توقيت للدقائق وساعة توقيت للثواني) الدقة: ±20 ثانية في الشهر تقريباً. عمر البطارية: 3 سنوات مع SR920SW، حجم الهيكل: 52 × 48.9 × 12.4 ملم. الوزن الإجمالي: 172 جرام',
    'مادة الهيكل/الإطار: ساعة ذات سوار ستانلس ستيل بمشبك ثلاثي الطي بلمسة واحدة مع زجاج معدني وغطاء خلفي يقفل ببراغي، كما أنها مقاومة للماء حتى عمق 100 مترًا، بميزة ساعة توقيت لمدة 1/10 ثانية قياس السعة: 59 و59 دقيقة و9 جزء من الثانية - اوضاع القياس: الوقت المنقضي، الوقت المنقسم، أوقات المكانين الأول والثاني عرض التاريخ عرض التوقيت العادي التناظري: 3 عقارب للساعة والدقيقة والثانية، و3 أقراص (ساعة ايقاف 1/10 ثانية وساعة توقيت للدقائق وساعة توقيت للثواني) الدقة: ±20 ثانية في الشهر تقريباً. عمر البطارية: 3 سنوات مع SR920SW، حجم الهيكل: 52 × 48.9 × 12.4 ملم. الوزن الإجمالي: 172 جرام'
  ];

  return (
    <section>
      <PageHeader 
        title={t('pageTitle')} 
        subTitle={t('pageDescription')}
      />
      
      <Container maxWidth={LayoutSettings.maxWidth} className={classes.contentWrapper}>
        {list.map((listItem: string, index: number) => (
          <Box key={index}>
            <p  className={classes.listItem}>
              {listItem}
            </p>

            {(index + 1 !== list.length) && (
              <Divider sx={{ my: 5 }} />
            )}
          </Box>
        ))}
      </Container>
    </section>
  );
};

export default AboutUs;
